/* 미로 찾기 */

/* user code */
function answer(input) {
  let result = -1;

  // 코드 구현 시작 영역

  // …

  // 코드 구현 종료 영역

  return result;
}

/* main code */
let input = [
  // TC: 1
  ["00110", "00010", "00110", "00000", "01011"],
  // TC: 2
  ["00110", "00010", "00110", "00010", "01011"],
  // TC: 3
  [
    "1111111100",
    "1111111101",
    "1111111101",
    "1000111101",
    "1010111101",
    "1010011101",
    "1011011101",
    "1011011101",
    "1011000001",
    "0011111111",
  ],
];

for (let i = 0; i < input.length; i++) {
  process.stdout.write(`#${i + 1} `);
  console.log(answer(input[i]));
}
